app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "book5"], ["body", "奇跡の３段とび"], ["created_at", "2021-11-01 12:23:21.583811"], ["updated_at", "2021-11-01 12:23:21.583811"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "r9kin"], ["body", "xi0g7yfpv9ljg7632gjx"], ["updated_at", "2021-11-01 13:13:43.898537"], ["id", 1]]